run/tutorials/multiphase/HeIIFoam/wycinekRuryBlockMeshBezQ/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//dimensions      [0 2 -2 0 0 0 0];
dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    WALL
    {
        type            zeroGradient;
    }
    INLET
    {
        type            fixedGradient;
		gradient		uniform 0.0;
    }
    OUTLET
    {
        type            fixedValue;
        value           uniform 0;
    }
    SYMMETRY-SIDE-1
    {
        type            wedge;
    }
    SYMMETRY-SIDE-2
    {
        type            wedge;
    }
}

// ************************************************************************* //
