run/tutorials/multiphase/HeIIFoam/wycinekRuryBlockMeshBezQ/constant/polyProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      polyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

	rhosCoeff
	5
	(
		-2696.81054
		6855.44235
		-6176.68492
		2473.62734
		-377.05125
	);

	rhonCoeff
	5
	(
		2870.689
		-6924.81269
		6239.29583
		-2498.74542
		380.86479
	);

	sCoeff
	5
	(
		14435.05915
		-34722.24338
		31305.25427
		-12659.15927
		2001.21128
	);

	muCoeff
	5
	(
		1.20806e-4
		-2.85214e-4
		2.56473e-4
		-1.02843e-4
		1.54977e-5
	);

	kCoeff
	2
	(
		-8.82473e-5
		0.00198
	);

	tCoeff
	7
	(
		1.119828
		2.760203e-3
		-5.525212e-6
		7.865921e-9
		-6.615903e-12
		2.946865e-15
		-5.355674e-19
	);

	ACoeff
	13
	(
		-215578974340.811
		1273802886580.47
		-3325614785079.6
		4983045815807.77
		-4600709746924.67
		2501663779779.83
		-502178683119.183
		-335870174830.809
		330421235808.988
		-137725735575.13
		32840174913.9817
		-4365737228.88577
		252790501.058098
	);

// ************************************************************************* //
