run/tutorials/multiphase/HeIIFoam/wycinekRuryBlockMeshBezQ/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

activeGorterMellink true;

activeGradW true;

Q0  			Q0		[1 2 -3 0 0 0 0] 0; // (en W)

tau  			tau 	[0 0 1 0 0 0 0] 1e-5;

mus             mus 	[ 1 -1 -1 0 0 0 0 ] 1e-12;


// ************************************************************************* //
