run/tutorials/multiphase/HeIIFoam/wycinekRuryBlockMeshBezQ/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0.01;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }


    "(Un|Us)Final"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }

    T
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-13;
        relTol          0;
    }

    TFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0;
    }

}

PIMPLE
{
	nOuterCorrectors 1;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
